# Assignment 3 - Class Work
## Topic: Handle Missing Values

### Question 1
Create a student data frame using missing values. The dataset should have the following information.

('ID','Name','Age',’Gender’,'Math_Marks','Science_Marks',’English_Marks’,’Percentage of Attendance’)

In [1]:
import pandas as pd
import numpy as np

data = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Amit', 'Riya', 'Sohan', 'Neha', 'Arjun'],
    'Age': [20, np.nan, 22, np.nan, 21],
    'Gender': ['M', 'F', 'M', 'F', 'M'],
    'Math_Marks': [85, np.nan, 78, 90, np.nan],
    'Science_Marks': [88, 92, np.nan, 85, 80],
    'English_Marks': [75, 80, 82, np.nan, np.nan],
    'Percentage of Attendance': [90, 85, np.nan, 88, 92]
}

df = pd.DataFrame(data)
df

,ID,Name,Age,Gender,Math_Marks,Science_Marks,English_Marks,Percentage of Attendance
0,1,Amit,20.0,M,85.0,88.0,75.0,90.0
1,2,Riya,NaN,F,NaN,92.0,80.0,85.0
2,3,Sohan,22.0,M,78.0,NaN,82.0,NaN
3,4,Neha,NaN,F,90.0,85.0,NaN,88.0
4,5,Arjun,21.0,M,NaN,80.0,NaN,92.0

### Question 2
Check whether missing values are there or not.

In [2]:
df.isnull()

,ID,Name,Age,Gender,Math_Marks,Science_Marks,English_Marks,Percentage of Attendance
0,False,False,False,False,False,False,False,False
1,False,False,True,False,True,False,False,False
2,False,False,False,False,False,True,False,True
3,False,False,True,False,False,False,True,False
4,False,False,False,False,True,False,True,False

### Question 3
Print the column which is having missing values

In [3]:
df.columns[df.isnull().any()]

Index(['Age', 'Math_Marks', 'Science_Marks', 'English_Marks',
       'Percentage of Attendance'],
      dtype='str')

### Question 4
Filling missing ‘Age’ value by mean value.

In [4]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df

,ID,Name,Age,Gender,Math_Marks,Science_Marks,English_Marks,Percentage of Attendance
0,1,Amit,20.0,M,85.0,88.0,75.0,90.0
1,2,Riya,21.0,F,NaN,92.0,80.0,85.0
2,3,Sohan,22.0,M,78.0,NaN,82.0,NaN
3,4,Neha,21.0,F,90.0,85.0,NaN,88.0
4,5,Arjun,21.0,M,NaN,80.0,NaN,92.0

### Question 5
Fill Missing Marks with Subject-wise Mean.

In [5]:
marks = ['Math_Marks', 'Science_Marks', 'English_Marks']
df[marks] = df[marks].fillna(df[marks].mean())
df

,ID,Name,Age,Gender,Math_Marks,Science_Marks,English_Marks,Percentage of Attendance
0,1,Amit,20.0,M,85.000000,88.00,75.0,90.0
1,2,Riya,21.0,F,84.333333,92.00,80.0,85.0
2,3,Sohan,22.0,M,78.000000,86.25,82.0,NaN
3,4,Neha,21.0,F,90.000000,85.00,79.0,88.0
4,5,Arjun,21.0,M,84.333333,80.00,79.0,92.0

### Question 6
Drop Rows with Missing Value

In [6]:
df.dropna()

,ID,Name,Age,Gender,Math_Marks,Science_Marks,English_Marks,Percentage of Attendance
0,1,Amit,20.0,M,85.000000,88.0,75.0,90.0
1,2,Riya,21.0,F,84.333333,92.0,80.0,85.0
3,4,Neha,21.0,F,90.000000,85.0,79.0,88.0
4,5,Arjun,21.0,M,84.333333,80.0,79.0,92.0